import { Poem } from "@/lib/types/poem";

export const hindiPoems: Poem[] = [
  {
    title: "सवाल",
    content: `कहूं कि न कहूं, सवाल ही गलत है ।  
क्या कहूं क्यों कहूं, मलाल ही गलत है ।  
वक़्त ठहरता थोड़ा सा तो मैं भी इंतज़ार कर लेता 
वो गुज़र जायेगा और मैं रहूँगा यहीं ये ख्याल ही गलत है ।  

मुझसे कहे कोई कि सफर की हर बात तय कर लो 
अब से क्या क्या होगा ये मय कर लो 
जिसने तय किया मेरा सफर ये तो वो बताएगा 
अगला पल क्या होगा मुझसे तो ये सवाल ही गलत है 

किसी दिन उलझन में मेरा कसूर मत देखना 
समझ में न आये उसकी कोई बात तो मेरा खत न फेंकना 
लिखा जरूर मैंने एक जवाब 
मगर उस जवाब का सवाल ठीक है ये सवाल ही गलत है ।  

ये लगता तो जरूर है कि ये मेरी ग़ज़ल है 
मगर मेरे पास बस एक सफा और एक कलम है 
उसे है आदत बस यही मुझ पर शेर पढ़ देने की 
मेरी तकदीर की तस्वीर मेरे पास है ये ख्याल ही गलत है।  

रहमत से उसने मुझे इबादत देदी 
हर बात पे हाथ फ़ैलाने सर झुकाने की आदत देदी
इरादा भी है मेरा वादा भी है 
मगर मोहलत है वादा निभाने की ये सवाल ही गलत है।  
मैं रहूँगा यहीं ये ख्याल ही गलत है।  `,
  },

  {
    title: "पलों से पल मिलते हैं",
    content: `आज परिंदे को मैंने वो जगह दिखाई 
जहाँ हर पल मुझे मेरे पल मिलते हैं 
सूरज कि किरणों को चांदनी के रंग में देखकर गुनगुना उठा  पपीहा

ठहरा हुआ वक्त बस एक फिकरा नहीं
वो खुद हैरान है देखकर कि कैसे पलों से पल मिलते हैं 

वो जो खनक है मुस्कराहट की जो उफ़क को महसूस हो
अब हमारी यादों में चल वहीँ चले जहाँ आज और कल मिलते हैं 

कोई दूसरा जहाँ है सुना है जहाँ यहाँ होते हुए भी हम वहां होंगे 
और सिर्फ परिंदों को पता होगा 
कोई तो नक्शा दिखाता होगा जहाँ इस जहाँ के पलों से उस जहाँ के पल मिलते हैं 

हवाओं से अभी अभी एक हल मिला है 
जो वहां होकर आया है पल मिला है 
कहता है यकीन रख उसके बनाये आज में 
जो आज ये पल उसी का तो फिर उसके हर इस पल को कल उसीका पल मिलता है`,
  },
  {
    title: "हिस्सा",
    content: `तुमने ऐसा क्या सोचा मेरे बारे में जो मैं हिस्सा बन गया तुम्हारा 
कोई बात ऐसी है मेरे बारे में जो मुझे पता नहीं है 
कहीं नीले रंग में घुला मैं उसी बात को लेकर मिला तुमसे  और हिस्सा बन गया तुम्हारा 

तुमने देखा मुझे वहां जहाँ नहीं था मैं 
साथ ले गए या बुलाया होगा उफ़क (क्षितिज) के पास 
मगर कैसे जो मैं हिस्सा बन गया तुम्हारा 

क्या बात हुई जो महसूस तो होती है मुझे मगर पता नहीं है।  
वो उफ़क दिखाई पड़ा जो  आईने में तुम्हे आँखों में 
तो मालूम पड़ा के मैं हिस्सा बन गया तुम्हारा 

बड़ा सुकून हुआ है उस हिस्से को देखकर अपने 
मुझसे दूर मगर बहुत खुश है मेरा वो हिस्सा जो हिस्सा बन गया तुम्हारा 

चलते चलते उसके साथ अपनी बातों में कभी 
मुझे भी शामिल किया करो  कि थोड़ा सा ही सही 
वो मैं ही तो हूँ जो हिस्सा बन गया तुम्हारा
`,
  },
];
